<!DOCTYPE html>
<html lang="en">

<head>

  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
  <meta name="description" content="">
  <meta name="author" content="">

  <title>Summary - Calculisto</title>

  <!-- Bootstrap core CSS -->
  <!-- <link href="vendor/bootstrap/css/bootstrap.min.css" rel="stylesheet"> -->
  <link href="./css/bootstrap.min.css" rel="stylesheet">
  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.3/css/all.min.css" integrity="sha512-iBBXm8fW90+nuLcSKlbmrPcLa0OT92xO1BIsZ+ywDWZCvqsWgccV3gFoRBv0z+8dLJgyAHIhR35VZc2oM/gI1w==" crossorigin="anonymous" />

  <!-- Custom styles for this template -->
  <link href="css/simple-sidebar.css" rel="stylesheet">

</head>

<body>

  <div class="d-flex" id="wrapper">

    <!-- Sidebar -->
    <div class="bg-primary border-right" id="sidebar-wrapper">
      <!-- <div class="sidebar-heading">Start Bootstrap </div> -->
      <img src="./img/logo.png" alt="" class="img-fluid d-block mx-auto mt-2 mb-3" style="max-width: 150px;">

      <ul class="nav flex-column list-group list-group-flush sidebar-nav">
        <div id="main-menu" class="list-group">
            <a href="#sub-menu" class="list-group-item" data-toggle="collapse" data-parent="#main-menu">Item 1 <i class="fa fa-chevron-down ml-1" style="font-size: .6rem"></i></a>
            <div class="collapse list-group-level1" id="sub-menu">
                <a href="#" class="list-group-item bg-secondary" data-parent="#sub-menu">Sub Item 1</a>
                <a href="#" class="list-group-item bg-secondary" data-parent="#sub-menu">Sub Item 2</a>
                <a href="#sub-sub-menu" class="list-group-item bg-secondary" data-toggle="collapse" data-parent="#sub-menu">Sub Item 3 <i class="fa fa-chevron-down ml-1" style="font-size: .6rem"></i></a>
                <div class="collapse list-group-level2" id="sub-sub-menu">
                    <a href="#" class="list-group-item bg-dark" data-parent="#sub-sub-menu">Sub Sub Item 1</a>
                    <a href="#" class="list-group-item bg-dark" data-parent="#sub-sub-menu">Sub Sub Item 2</a>
                    <a href="#" class="list-group-item bg-dark" data-parent="#sub-sub-menu">Sub Sub Item 3</a>
                </div>
            </div>
          
            <a href="#" class="list-group-item">Item 2</a>
            <a href="#" class="list-group-item">Item 3</a>
            <a href="#" class="list-group-item">Item 4</a>
            <a href="#" class="list-group-item">Item 5</a>
        </div>
      </ul>
    </div>
    <!-- /#sidebar-wrapper -->

    <!-- Page Content -->
    <div id="page-content-wrapper">


      <nav class="navbar navbar-expand-lg navbar-light bg-primary border-0">
        <!-- <button class="btn btn-purple" id="menu-toggle">Hide Menu</button> -->
        <button class="btn btn-link"  id="menu-toggle">
          <i class="fa fa-bars fa fa-2x text-light"></i>
        </button>


        <!-- <button class="navbar-toggler" type="button" data-toggle="collapse" data-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
          <span class="navbar-toggler-icon"></span>
        </button> -->


        
      </nav>

      <div class="container-fluid p-lg-4 px-lg-5">
        <div class="card my-3 border-0 shadow">
          <div class="card-body">
            <div>
<div>
<nav aria-label="breadcrumb">
  <ol class="breadcrumb bg-white">
    <li class="breadcrumb-item"><a href="/">Home</a></li>
    <li class="breadcrumb-item"><a href="/subjects/calculo/">Calculo</a></li>
    <li class="breadcrumb-item active" aria-current="page">Prec&aacute;lculo</li>
  </ol>
</nav>
</div>
<h1>Elementos de la L&oacute;gica y Lenguaje Matem&aacute;tico</h1>
<p>&iexcl;Sean todos bienvenidos! En esta ocasi&oacute;n nos adentraremos en el mundo de la l&oacute;gica matem&aacute;tica.<strong></strong></p>
<p>Debes estar pensando: &ldquo;Para m&iacute;, no tiene l&oacute;gica alguna, nunca entiendo nada&rdquo;</p>
<p>Pero en esta ocasi&oacute;n empezar&aacute;s a entender. Para comenzar, te dir&eacute; el por qu&eacute; tenemos que aprenderla: al igual que cualquier idioma, las matem&aacute;ticas tienen su propio lenguaje.</p>
<p><img src="https://lh5.googleusercontent.com/-mglFGsALSVtDrbFHbxnHNOrrdxlVzQXQKZF94y9XZUFxECq-iRAvwELGzmXFy4-xcG0TClNsEDy6XUsCN2LrBDMb7SXi9tghcClsW3m04MAJkeQ8jk2CU5KUI4pFnntWafkuvIw" alt="" class="img-fluid d-block" /></p>
<p>&ldquo;&iquest;Por qu&eacute;?&rdquo;</p>
<p>Porque las grandes mentes pensaron que toda esta informaci&oacute;n deb&iacute;a volverse universal, para que todos pudieran interpretarla correctamente.</p>
<p>Lo que m&aacute;s complica la vida del estudiante es que, a veces, los t&eacute;rminos matem&aacute;ticos tienen significados bastante espec&iacute;ficos y diferentes de lo que estamos acostumbrados. Sin embargo, no te preocupes, har&eacute; todo lo posible para que puedas entender con m&aacute;s claridad este nuevo lenguaje.</p>
<h2><strong>&iquest;Qu&eacute; son las proposiciones?</strong></h2>
<p>Bien, tenemos dos teor&iacute;as relacionadas a la l&oacute;gica. Pero, lo interesante, es que trabajaremos con un mismo concepto en las dos: las proposiciones.</p>
<p>Si, las proposiciones son muy importantes, y seremos unos expertos en ellas.</p>
<p>&iquest;Sabes que es una proposici&oacute;n o has escuchado algo al respecto?</p>
<p>Las proposiciones matem&aacute;ticas no son m&aacute;s que frases (u oraciones) las cuales son atribuidas a un valor de VERDADERO o FALSO.&nbsp;</p>
<p><img src="https://lh6.googleusercontent.com/ip8JqpGOd6vEK3GHJu9eqiCdWnfVIjXUI_BT-EvCdyLnuyXQMapNEws9y-UIyB3wasKADMz3wEYnrsHJvOOSpXjkc59QA5LSRP3dmTgasJcXJsDMgOKx6trZ0P0t6V2EP5lCOuBR" class="img-fluid d-block" /></p><p>Por ejemplo:</p>
<ul>
<li>"2+5=7""2+5=7"</li>
</ul>
<p></p>
<ul>
<li>Yo soy una persona</li>
</ul>
<p></p>
<ul>
<li>"2234+3567&nbsp;es primo""2234+3567&nbsp;es primo" </li>
</ul>
<p>Todas esas frases son proposiciones, pues podemos decir que son verdaderas o falsas. Observa el ejemplo de una frase que NO es una proposici&oacute;n:</p>
<div>&nbsp;Hoy hace calor.&nbsp;Hoy hace calor.</div>
<p>No podemos decir que es verdadero o falso, porque no sabemos lo que es estar caliente; necesitar&iacute;amos una temperatura de comparaci&oacute;n. Otro ejemplo:</p>
<div>&iquest;Vamos comer?&iquest;Vamos comer?</div>
<p>&iquest;Podemos decir si es verdadero o falso? No, &iquest;verdad? Por tanto, no es una proposici&oacute;n.</p>
<p>En toda teor&iacute;a usaremos las letras p,q,rp,q,r y ss para identificar una proposici&oacute;n, &iquest;entendido? &iexcl;Vamos a all&aacute;!</p>
<h3><strong>Proposiciones abiertas</strong></h3>
<p>Vamos a estudiar algunas proposiciones que estaremos viendo a lo largo de esta teor&iacute;a, e identificaremos cada elemento:</p>
<div>p(x)="x&isin;N∣2&lt;x&lt;7"p(x)="x&isin;N∣2&lt;x&lt;7"</div>
<p>Notaste que no existe manera en que podemos determinar si es VERDADERO o FALSO, pues no podemos juzgarlo mediante ese razonamiento, estos casos son llamados proposiciones abiertas (justamente porque el valor de verdadero o falso queda abierto), donde la proposici&oacute;n depende de una o m&aacute;s variables (p(x),p(x,y)p(x),p(x,y)).</p>
<p>Para comenzar, observe que al principio tenemos p(x)p(x). Como te he dicho, pp es la manera en la que identificamos la proposici&oacute;n y escribimos p(x)p(x), pues es una proposici&oacute;n que tiene una variable xx unida a ella.</p>
<p>El conjunto de los n&uacute;meros naturales es nuestro dominio de discurso, es decir, sustituimos xx por el n&uacute;mero que pertenezcan al conjunto de los naturales, TAL QUE (aquel s&iacute;mbolo ∣∣) la xx est&eacute; entre el 22 y 77.</p>
<p>Bien, sabemos que no podemos juzgar a p(x)p(x), pero podemos juzgar, por ejemplo, p(3)p(3). O sea, vamos a sustituir xx por 33 y comprobar si es verdad:&nbsp;</p>
<div>p(3)="3&isin;N∣2&lt;3&lt;7"p(3)="3&isin;N∣2&lt;3&lt;7"</div>
<p>Genial, es verdadero, &iquest;concuerdas conmigo? 33 pertenece a los naturales y se encuentra entre 22 y 77. Ser&aacute;n los n&uacute;meros 3,4,53,4,5 y 66. Entonces el conjunto:</p>
<div>{3,4,5,6}{3,4,5,6}</div>
<p>Es llamado valor de verdad .Este es el conjunto de t&eacute;rminos que hacen que la proposici&oacute;n sea verdadera.</p>
<p>&iexcl;Genial! Hablamos acerca de todo lo importante en una proposici&oacute;n abierta: variable, dominio de discurso y valor de verdad.</p>
<h2><strong>Proposiciones Universales y Particulares&nbsp;</strong></h2>
<p>Usando las proposiciones abiertas, podemos hacer afirmaciones sobre todos los elementos de un conjunto, usando el cuantificador universal &forall;&forall; que significa &ldquo;para todo&rdquo;, &ldquo;para cada&rdquo; o &ldquo;cualquiera que sea&rdquo;. Se llama cuantificador porque expresa una cantidad.&nbsp;</p>
<p>Mira un ejemplo:&nbsp;</p>
<ul>
<li>Para escribir simb&oacute;licamente la proposici&oacute;n &ldquo;Para todo n&uacute;mero natural tenemos que 2n2n es par&rdquo;:</li>
</ul>
<div>&forall;n&isin;N,2n&nbsp;es par&forall;n&isin;N,2n&nbsp;es par</div>
<p>O</p>
<div>&forall;n&isin;N,p(n)&forall;n&isin;N,p(n)</div>
<p>En que p(n)="2n&nbsp;es par&nbsp;&rdquo;p(n)="2n&nbsp;es par&nbsp;&rdquo;</p>
<p>Observe que el &ldquo;tenemos que&rdquo; est&aacute; representado por una coma.&nbsp;</p>
<p>Adem&aacute;s, tambi&eacute;n podemos hacer afirmaciones sobre por lo menos un elemento de un conjunto, usando el cuantificador existencial &exist;&exist; que significa &ldquo;existe&rdquo;, es decir, pueden tener m&aacute;s elementos que satisfagan la relaci&oacute;n. Mira el siguiente ejemplo:</p>
<ul>
<li>Para escribir simb&oacute;licamente la proposici&oacute;n &ldquo;Existe un n&uacute;mero natural nn que es menor que 33&rdquo;</li>
</ul>
<div>&exist;n&isin;N∣n&lt;3&exist;n&isin;N∣n&lt;3</div>
<p>O</p>
<div>&exist;n&isin;N∣p(n)&exist;n&isin;N∣p(n)</div>
<p>En que p(n)="n&lt;3"p(n)="n&lt;3"</p>
<p>Existen casos en que apenas un elemento del dominio de discurso satisface la relaci&oacute;n. Observa:&nbsp;</p>
<ul>
<li>Para escribir simb&oacute;licamente la proposici&oacute;n &ldquo;Existe un n&uacute;mero natural nn que es menor que 11&rdquo;</li>
</ul>
<div>&exist;!n&isin;N∣n&lt;1&exist;!n&isin;N∣n&lt;1</div>
<p>Colocamos un signo de exclamaci&oacute;n para indicar que existe el elemento y es &uacute;nico (en este caso, ser&iacute;a n=0n=0)</p>
<p>Haciendo un resumen general: la proposici&oacute;n es universal cuando concierne a todos los elementos de un conjunto y es particular cuando no.</p>
<h2><strong>Ejemplos y contraejemplos&nbsp;</strong></h2>
<p>Veamos otra proposici&oacute;n:</p>
<div>&forall;n&isin;N,(n+1)2&nbsp;es impar&forall;n&isin;N,(n+1)2&nbsp;es impar</div>
<p>Traducido al espa&ntilde;ol:</p>
<div>Para todo n&uacute;mero natural&nbsp;n,&nbsp;tenemos que&nbsp;(n+1)2&nbsp;es imparPara todo n&uacute;mero natural&nbsp;n,&nbsp;tenemos que&nbsp;(n+1)2&nbsp;es impar</div>
<p>&iquest;Est&aacute;s de acuerdo en que 22 hace que esa afirmaci&oacute;n sea verdadera? Pues (2+1)2=9(2+1)2=9. Llamamos a este ejemplo: cada n&uacute;mero que hace que la proposici&oacute;n sea verdadera.</p>
<p>&iquest;Est&aacute;s de acuerdo en que 33 hace que esa afirmaci&oacute;n sea falsa? Pues (3+1)2=16(3+1)2=16. Llamamos a este contraejemplo: todo n&uacute;mero que hace que la proposici&oacute;n sea falsa (es decir, todo n&uacute;mero que pertenece al dominio, pero no est&aacute; en el valor de verdad)</p>
<p>Y el n&uacute;mero &minus;1&minus;1 no es ejemplo ni contraejemplo, pues pertenece al dominio (dominio de discurso)</p>
<p>De forma general, podemos decir que si una proposici&oacute;n universal tiene contraejemplos, es falsa. Piensa: en la proposici&oacute;n universal, estamos hablando de todos los elementos de un conjunto. Si encontramos algo en el conjunto que no respeta la relaci&oacute;n, quiere decir que es falsa.</p>
<p>Adem&aacute;s, si una proposici&oacute;n es particular, solo es verdadera si tiene ejemplos que lo demuestren, no existe problema alguno si tiene contraejemplos.</p>
<p><img src="https://lh6.googleusercontent.com/tT9FxS7YdcW6Q6L4yYvrJv0UfShlZ27nGkRMHZ-8mxh_o3d5c147KgLRDAxUE3ibbqf3Mc6Pu4Qhud7aS9vJdPSKPVULsouYSdD6cQEbDc-e_rpQyriNh0z14yY9jX_RPByipIuH" alt="" class="img-fluid d-block" /></p>
<h2><strong>Y, o y no</strong></h2>
<p>Ya hemos visto varias proposiciones, vamos a aprender a combinarlas. Por ejemplo:</p>
<div>3 es impar y 5 es par3 es impar y 5 es par</div>
<div>2 es primo o 9 es par2 es primo o 9 es par</div>
<p>En la primera fase, tenemos al conectivo (llamado as&iacute; porque conecta dos proposiciones) &ldquo;y&rdquo;&ldquo;y&rdquo; (representado por&nbsp;&and;)(representado por&nbsp;&and;). Matem&aacute;ticamente escribiendo:&nbsp;</p>
<div>p=3&nbsp;es imparp=3&nbsp;es impar</div>
<div>p=5&nbsp;es parp=5&nbsp;es par</div>
<p>En ese caso la frase es:</p>
<div>p&and;qp&and;q</div>
<p>&iexcl;Y esa combinaci&oacute;n solo ser&aacute; verdadera si las dos proposiciones son verdaderas! En este caso una de ellas es falsa, entonces la proposici&oacute;n compuesta tambi&eacute;n lo es.&nbsp;</p>
<div>p&nbsp;es verdaderap&nbsp;es verdadera</div>
<div>q&nbsp;es falsaq&nbsp;es falsa</div>
<p>Por tanto:</p>
<div>p&and;q&nbsp;es falsap&and;q&nbsp;es falsa</div>
<p>La segunda frase tiene el conectivo &ldquo;o&rdquo;&ldquo;o&rdquo; representado por&nbsp;&or;representado por&nbsp;&or;</p>
<p> </p>
<div>p=2&nbsp;es primop=2&nbsp;es primo</div>
<p> </p>
<div>q=9&nbsp;es parq=9&nbsp;es par</div>
<p>Entonces tenemos:</p>
<div>p&or;qp&or;q</div>
<p>Te adelanto que esa proposici&oacute;n es verdadera</p>
<p>&ldquo;&iexcl;Que! &iquest;C&oacute;mo as&iacute;? 99 no es par&rdquo;</p>
<p>Pues s&iacute;, aqu&iacute; est&aacute; la diferencia de a lo que estamos acostumbrados. En matem&aacute;tica, una proposici&oacute;n compuesta con &ldquo;o&rdquo;&ldquo;o&rdquo; es verdadera siempre que una de las proposiciones es verdadera; es decir, la &uacute;nica forma de que esta sea falsa es si una de las dos proposiciones es falsa. Observa la siguiente tabla:</p>
<p><img src="https://lh3.googleusercontent.com/mZNKbP2wcqxkjxtan_h4D4gc8Aqy-Ze-mWiSmY78NaOzaEjI2FyBXXpe4bIuu7Z5G7Ty1B_xSPdbqj2_09MLE6Qq2cDg1nTgag76kBpncRYzl7DcdBN0T6H7rUT6U-ukMGIFoJuh" alt="" /></p>
<p>&iexcl;Ahora aprenderemos c&oacute;mo negar las proposiciones! Es super divertido</p>
<p>Cuando negamos una proposici&oacute;n, decimos que esta no es verdadera. Mira:</p>
<div>La negaci&oacute;n de&nbsp;p&nbsp;es no&nbsp;(p)&nbsp;o&nbsp;&not;pLa negaci&oacute;n de&nbsp;p&nbsp;es no&nbsp;(p)&nbsp;o&nbsp;&not;p</div>
<div>La negaci&oacute;n de&nbsp;p&and;q&nbsp;es no&nbsp;(p)&or;no&nbsp;(q)La negaci&oacute;n de&nbsp;p&and;q&nbsp;es no&nbsp;(p)&or;no&nbsp;(q)</div>
<div>La negaci&oacute;n de&nbsp;p&or;q&nbsp;es no&nbsp;(p)&and;no&nbsp;(q)La negaci&oacute;n de&nbsp;p&or;q&nbsp;es no&nbsp;(p)&and;no&nbsp;(q)</div>
<div>La negaci&oacute;n de no&nbsp;(p)&nbsp;es&nbsp;pLa negaci&oacute;n de no&nbsp;(p)&nbsp;es&nbsp;p</div>
<p>Es decir, cada vez que niegues &ldquo;y&rdquo;&ldquo;y&rdquo; o &ldquo;o&rdquo;&ldquo;o&rdquo;, piensa que uno se convierte en el otro. Primero, colocas no en todo, luego arreglas el s&iacute;mbolo: si era &ldquo;y&rdquo;&ldquo;y&rdquo; se convierte en &ldquo;o&rdquo;&ldquo;o&rdquo; y si era &ldquo;o&rdquo;&ldquo;o&rdquo; se convierte en &ldquo;y&rdquo;&ldquo;y&rdquo;. Tiene sentido que la negaci&oacute;n de la negaci&oacute;n sea la propia pp.</p>
<p>Ejemplo:</p>
<ul>
<li>La negaci&oacute;n de &ldquo;x&nbsp;es divisible por 4 y&nbsp;x&nbsp;es divisible por&nbsp;7x&nbsp;es divisible por 4 y&nbsp;x&nbsp;es divisible por&nbsp;7&rdquo; es &ldquo;x&nbsp;no es divisible por&nbsp;4&nbsp;o&nbsp;x&nbsp;no es divisible por&nbsp;7x&nbsp;no es divisible por&nbsp;4&nbsp;o&nbsp;x&nbsp;no es divisible por&nbsp;7&rdquo;</li>
</ul>
<p>Ahora vamos a aprender a negar los cuantificadores &forall;&forall; y &exist;&exist;. &iquest;Adivina qu&eacute;? Uno se convierte en el otro tambi&eacute;n. Ejemplo:</p>
<ul>
<li>Existe un n&uacute;mero entero xx tal que x+2=1x+2=1</li>
</ul>
<p>Vamos a negar esa proposici&oacute;n, &iquest;bien? Escribiendo matem&aacute;ticamente:</p>
<div>&exist;x&isin;Z∣x+2=1&exist;x&isin;Z∣x+2=1</div>
<p>O</p>
<div>&exist;x&isin;Z∣p(x)&exist;x&isin;Z∣p(x)</div>
<p>En que p(x):"x+2=1"p(x):"x+2=1"</p>
<div>&not;(&exist;x&isin;Z∣p(x))=&not;(&exist;x&isin;Z),&not;(p(x))&not;(&exist;x&isin;Z∣p(x))=&not;(&exist;x&isin;Z),&not;(p(x))</div>
<p>Observa que &ldquo;tal que&rdquo; se convierte en una coma en la negaci&oacute;n. Y si tuvieras una coma se convierte en &ldquo;tal que&rdquo; en la negaci&oacute;n. Adem&aacute;s, hicimos algo parecido a una distributiva, colocando la negaci&oacute;n antes de la antigua y despu&eacute;s de esta. Continuando:&nbsp;</p>
<div>&not;(&exist;x&isin;Z),&not;(p(x))=&exist;̸x&isin;Z,x+2&ne;1&not;(&exist;x&isin;Z),&not;(p(x))=∄x&isin;Z,x+2&ne;1</div>
<p>Se que parece m&aacute;s intuitivo decir que la negaci&oacute;n de &ldquo;existe&rdquo; es &ldquo;no existe&rdquo; (no est&aacute;s equivocado), concuerdo, sin embargo, lo m&aacute;s acertado es colocar &ldquo;para todo&rdquo;:</p>
<div>&not;(&exist;x&isin;Z∣x+2=1)=&forall;x&isin;Z,x+2&ne;1&not;(&exist;x&isin;Z∣x+2=1)=&forall;x&isin;Z,x+2&ne;1</div>
<a data-id="543" data-target="#addFaqSchemaModal" data-toggle="modal"> Hay un error? </a> <br /> <a href="/topics/51/544"> Ir al Siguiente Capitulo: Fundamentos de la L&oacute;gica y Lenguaje Matem&aacute;tico </a><br /> <a href="/subjects/calculo">Todos los Res&uacute;menes</a>
<div>
<div>
<div><form accept-charset="UTF-8" action="/summaries/543/add_error" method="post"><input name="utf8" type="hidden" value="✓" /><input name="_method" type="hidden" value="patch" /><input name="authenticity_token" type="hidden" value="zWjlJK+ZdldKGuBWaj/8oMW64aAiLC77FIZvuZ7AbsMsitPpTv7Uyi8zURfX4glq7jTKsB+O+aQVHog5MSwpmQ==" />
<div>
<h4>Ay&uacute;danos a mejorar</h4>
<button type="button" data-dismiss="modal">&times;</button></div>
<div>Si has encontrado alg&uacute;n error, escr&iacute;banos abajo lo que no parece correcto, nosotros lo solucionaremos..</div>
<div><textarea name="fix" rows="10"></textarea></div>
<div><button type="button" data-dismiss="modal">Cerrar</button> <input name="commit" type="submit" value="Enviar" data-disable-with="Enviar" /></div>
</form></div>
</div>
</div>
</div>
          </div>
        </div>
      </div>
    </div>
    <!-- /#page-content-wrapper -->

  </div>
  <!-- /#wrapper -->

  <!-- Bootstrap core JavaScript -->
  <script src="vendor/jquery/jquery.min.js"></script>
  <script src="vendor/bootstrap/js/bootstrap.bundle.min.js"></script>

  <!-- Menu Toggle Script -->
  <script>
    $.fn.extend({
    toggleText: function(a, b){
        return this.text(this.text() == b ? a : b);
    }
});
    $("#menu-toggle").click(function(e) {
      e.preventDefault();
      $("#wrapper").toggleClass("toggled");
      // $(this).toggleText('Hide Menu', 'Show Menu');
    });
  </script>

</body>

</html>
